Tekla Open API Reference for Tekla Structures 2025
AABB Constructor (AABB)
 Instantiates a new axis-aligned 3d bounding box which is a copy of the given axis-aligned 3d bounding box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB(
	AABB AABB
)
Public Sub New (
	AABB As AABB
)
Parameters
AABB
Type: Tekla.Structures.Geometry3d.AABB
The axis-aligned 3d bounding box to copy from.
See Also
Reference
AABB Class
AABB Overload
Tekla.Structures.Geometry3d Namespace